configuration/src/Catalogs/ЮридическиеЛица/ЮридическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЮридическиеЛица</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыбораСтоимостиУслуги</name>
    <type>
      <types>EnumRef.СпособыВыбораСтоимостиУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьУслугиВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.Страны</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяИТОрганизацией</name>
    <comment>Признак того, что юр. лицо занимается IT-деятельностью</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/InformationRegisters/ОчередьСобытийНаОбработку/ОчередьСобытийНаОбработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьСобытийНаОбработку</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <comment>Данные события в формате JSON</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Пользователь, инициировавший данное событие</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <comment>Дата обработки события</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПотока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <comment>Признак успешной обработки события</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатОбработки</name>
    <comment>Строка с описанием ошибки обработки</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект, к которому относится событие</comment>
    <type>
      <types>CatalogRef.Должности</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Филиалы</types>
      <types>DocumentRef.Спринт</types>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>DocumentRef.ВнутренниеТрудозатраты</types>
      <types>DocumentRef.ОбработкаЭскалацииОшибок</types>
      <types>CatalogRef.Продукты</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.КарточкаКанбан</types>
      <types>CatalogRef.Процессы</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.ТипыСобытийОчереди</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСобытия</name>
    <comment>Для обеспечения уникальности записей</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/ЮридическиеЛица/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбъявлениеПеременных

// Хранит состояние объекта до записи
Перем ДанныеДоЗаписи;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Страна = Справочники.Страны.Россия Тогда
		Если НЕ ИННКорректный(ИНН) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Введён некорректный ИНН", , , "Объект.ИНН", Отказ);
		КонецЕсли;
	Иначе
		ИндексКПП = ПроверяемыеРеквизиты.Найти("КПП");
		
		Если ИндексКПП <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексКПП);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ИНН = СокрЛП(ИНН);
	
	Если ЭтоНовый() Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ДанныеДоЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ЯвляетсяИТОрганизацией");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДанныеДоЗаписи.ЯвляетсяИТОрганизацией <> ЯвляетсяИТОрганизацией Тогда
		РегистрыСведений.ОчередьСобытийНаОбработку.ДобавитьЗаданиеПроверитьТипыФилиалов(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИННКорректный(Знач ИНН)
	
	ИНН = СокрЛП(ИНН);
	ДлинаИНН = СтрДлина(ИНН);
	ИННКорректный = Ложь;
	
	Если ДлинаИНН = 10 Тогда
		КонтрольнаяСумма = 0;
		
		Множитель10 = Новый Соответствие;
		Множитель10.Вставить(1, 2);
		Множитель10.Вставить(2, 4);
		Множитель10.Вставить(3, 10);
		Множитель10.Вставить(4, 3);
		Множитель10.Вставить(5, 5);
		Множитель10.Вставить(6, 9);
		Множитель10.Вставить(7, 4);
		Множитель10.Вставить(8, 6);
		Множитель10.Вставить(9, 8);
		
		Для НомерСимвола = 1 По 9 Цикл
			КонтрольнаяЦифра = Число(Сред(ИНН, НомерСимвола, 1));
			КонтрольнаяСумма = КонтрольнаяСумма + КонтрольнаяЦифра * Множитель10[НомерСимвола];
		КонецЦикла;
		
		КонтрольнаяЦифра = Число(Сред(ИНН, 10, 1));
		ИННКорректный = ((КонтрольнаяСумма % 11) % 10 = КонтрольнаяЦифра);
	ИначеЕсли ДлинаИНН = 12 Тогда
		КонтрольнаяСумма11 = 0;
		КонтрольнаяСумма12 = 0;
		
		Множитель11 = Новый Соответствие;
		Множитель11.Вставить(1, 7);
		Множитель11.Вставить(2, 2);
		Множитель11.Вставить(3, 4);
		Множитель11.Вставить(4, 10);
		Множитель11.Вставить(5, 3);
		Множитель11.Вставить(6, 5);
		Множитель11.Вставить(7, 9);
		Множитель11.Вставить(8, 4);
		Множитель11.Вставить(9, 6);
		Множитель11.Вставить(10, 8);
		Множитель11.Вставить(11, 0);
		
		Множитель12 = Новый Соответствие;
		Множитель12.Вставить(1, 3);
		Множитель12.Вставить(2, 7);
		Множитель12.Вставить(3, 2);
		Множитель12.Вставить(4, 4);
		Множитель12.Вставить(5, 10);
		Множитель12.Вставить(6, 3);
		Множитель12.Вставить(7, 5);
		Множитель12.Вставить(8, 9);
		Множитель12.Вставить(9, 4);
		Множитель12.Вставить(10, 6);
		Множитель12.Вставить(11, 8);
		
		Для НомерСимвола = 1 По 11 Цикл
			КонтрольнаяЦифра = Число(Сред(ИНН, НомерСимвола, 1));
			КонтрольнаяСумма11 = КонтрольнаяСумма11 + КонтрольнаяЦифра * Множитель11[НомерСимвола];
			КонтрольнаяСумма12 = КонтрольнаяСумма12 + КонтрольнаяЦифра * Множитель12[НомерСимвола];
		КонецЦикла;
		
		КонтрольнаяЦифра11 = Число(Сред(ИНН, 11, 1));
		КонтрольнаяЦифра12 = Число(Сред(ИНН, 12, 1));
		
		ИННКорректный11 = ((КонтрольнаяСумма11 % 11) % 10 = КонтрольнаяЦифра11);
		ИННКорректный12 = ((КонтрольнаяСумма12 % 11) % 10 = КонтрольнаяЦифра12);
		ИННКорректный = ИННКорректный11 И ИННКорректный12;
	КонецЕсли;
	
	Возврат ИННКорректный
	
КонецФункции

#КонецОбласти
